In [2]:
# 2015 Uberdata_ processing

# Dependencies
from pathlib import Path
import pandas as pd

#2015 data_data1
Uber_trips_janjune_15 = Path("Raw_Data/uber-raw-data-janjune-15.csv")

# Load the CSV data into a DataFrame
df1 = pd.read_csv(Uber_trips_janjune_15)
df1.head()

  Dispatching_base_num          Pickup_date Affiliated_base_num  locationID
0               B02617  2015-05-17 09:47:00              B02617         141
1               B02617  2015-05-17 09:47:00              B02617          65
2               B02617  2015-05-17 09:47:00              B02617         100
3               B02617  2015-05-17 09:47:00              B02774          80
4               B02617  2015-05-17 09:47:00              B02617          90

  dispatching_base_number      date  active_vehicles  trips
0                  B02512  1/1/2015              190   1132
1                  B02765  1/1/2015              225   1765
2                  B02764  1/1/2015             3427  29421
3                  B02682  1/1/2015              945   7679
4                  B02617  1/1/2015             1228   9537

In [3]:
# Count the number of rows in combined_df
num_rows = len(df1)
print("Number of rows df1:", num_rows)

Number of rows df1: 14270479

In [6]:
# Check for missing data
missing_data = df1.isnull()

# Summarize missing data counts
missing_counts = missing_data.sum()

# Print or use missing_counts as needed
print("Missing data counts:")
print(missing_counts)

Missing data counts:
Dispatching_base_num         0
Pickup_date                  0
Affiliated_base_num     162195
locationID                   0
dtype: int64

In [7]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14270479 entries, 0 to 14270478
Data columns (total 4 columns):
 #   Column                Dtype
---  ------                -----
 0   Dispatching_base_num  object
 1   Pickup_date           object
 2   Affiliated_base_num   object
 3   locationID            int64
dtypes: int64(1), object(3)
memory usage: 435.5+ MB

In [ ]:
# Check for duplicates and missing vlaues. Remove both

In [4]:
#2015 data_data2: Uber_trips_JanFeb_15
#Uber_trips_JanFeb_15= Path("Raw_Data/Uber-Jan-Feb-FOIL.csv")

# Load the CSV data into a DataFrame
#df2 = pd.read_csv(Uber_trips_JanFeb_15)
#df2.head()

  dispatching_base_number      date  active_vehicles  trips
0                  B02512  1/1/2015              190   1132
1                  B02765  1/1/2015              225   1765
2                  B02764  1/1/2015             3427  29421
3                  B02682  1/1/2015              945   7679
4                  B02617  1/1/2015             1228   9537